brew "automake"
brew "bat" # https://github.com/sharkdp/bat
brew "binutils"
brew "cargo"
brew "cmake"
brew "curl"
brew "dive"
brew "docker"
brew "fd" # https://github.com/sharkdp/fd
brew "fzf"
brew "gdb"
brew "git"
brew "git-cola" # https://github.com/git-cola/git-cola
brew "gnuplot"
brew "go"
brew "graphviz"
brew "grv" # https://github.com/rgburke/grv
brew "haskell-stack"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "jekyll"
brew "libgit2"
brew "libuv"
brew "llvm"
brew "macvim"
brew "mercurial"
brew "mysql"
brew "node" # npm will be installed with node
brew "pandoc"
brew "postgresql"
brew "python3"
brew "r"
brew "ripgrep" # https://github.com/BurntSushi/ripgrep
brew "ruby"
brew "shellcheck" # https://github.com/koalaman/shellcheck
brew "sqlite"
brew "the_silver_searcher" # https://github.com/ggreer/the_silver_searcher
brew "tig" # https://github.com/jonas/tig
brew "tmux"
brew "tree"
brew "valgrind"
brew "wget"
brew "youtube-dl" # https://github.com/rg3/youtube-dl/
brew "zsh"
cask "atom"
cask "chromedriver"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "gitup" # https://gitup.co/
cask "google-backup-and-sync" # ..file-stream for business
cask "google-chrome"
cask "iterm2"
cask "java"
cask "libreoffice"
cask "licecap" # https://github.com/justinfrankel/licecap
cask "mactex"
cask "mendeley"
cask "pycharm-ce" # Community Edition
cask "r-app"
cask "signal"
cask "spotify"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
tap "wagoodman/dive"
